---
title: Marble
classe: Autodesk.Revit.DB.Visual.Marble
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# Marble

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String MarbleColor1 { get; }` | `Marble.MarbleColor1` | String |
| `String MarbleColor2 { get; }` | `Marble.MarbleColor2` | String |
| `String MarbleSize { get; }` | `Marble.MarbleSize` | String |
| `String MarbleWidth { get; }` | `Marble.MarbleWidth` | String |
| `String TextureAngle { get; }` | `Marble.TextureAngle` | String |
| `String TextureLinkTextureTransforms { get; }` | `Marble.TextureLinkTextureTransforms` | String |
| `String TextureRealWorldOffsetX { get; }` | `Marble.TextureRealWorldOffsetX` | String |
| `String TextureRealWorldOffsetY { get; }` | `Marble.TextureRealWorldOffsetY` | String |
| `String TextureRealWorldOffsetZ { get; }` | `Marble.TextureRealWorldOffsetZ` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```